Учет_кабельной_продукции/src/Documents/ЗаявкиНаПредъявлениеВыполненныхЭМР/ЗаявкиНаПредъявлениеВыполненныхЭМР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаПредъявлениеВыполненныхЭМР</name>
  <basedOn>Document.МонтажКабельнойПродукции</basedOn>
  <registerRecords>InformationRegister.ДанныеПоЗаданиямПоПрокладкеКабелей</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоЖурналамКабельнойПродукции</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКабельныхЛиний</types>
    </type>
  </attributes>
  <attributes>
    <name>ИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСтроительства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаАннулировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Учет_кабельной_продукции/src/InformationRegisters/ДанныеПоЖурналамКабельнойПродукции/ДанныеПоЖурналамКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоЖурналамКабельнойПродукции</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКабельныхЛиний</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаАннулировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЗаявкиПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявкиПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналИКЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСтроительства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспертНаправлений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиВМонтаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖЧерновик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОМонтаже</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЖурналУчетаКабельнойЛинии</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/Documents/ЗаявкиНаПредъявлениеВыполненныхЭМР/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыКабельныхЛиний.Подписан Тогда		
		ДобавитьЗаписиПоРегиструЗадания();
	КонецЕсли;	
	
	ДобавитьЗаписиПоРегиструЖурналКабели();
	
КонецПроцедуры  

Процедура ДобавитьЗаписиПоРегиструЗадания()

	Движения.ДанныеПоЗаданиямПоПрокладкеКабелей.Записывать = Истина;
	
	НоваяЗапись                           = Движения.ДанныеПоЗаданиямПоПрокладкеКабелей.Добавить();
	НоваяЗапись.Период                    = Дата;
	НоваяЗапись.ЖурналУчетаКабельнойЛинии = ЖурналУчетаКабельнойПродукции;    
	НоваяЗапись.Подрядчик                 = Подрядчик;
	НоваяЗапись.Статус                    = Перечисления.СтатусыЗаданийНаЗакупку.Выполнено;
	
КонецПроцедуры   

Процедура ДобавитьЗаписиПоРегиструЖурналКабели()

	Движения.ДанныеПоЖурналамКабельнойПродукции.Записывать = Истина;
	
	НоваяЗапись                           = Движения.ДанныеПоЖурналамКабельнойПродукции.Добавить();
	НоваяЗапись.Период                    = Дата;
	НоваяЗапись.ЖурналУчетаКабельнойЛинии = ЖурналУчетаКабельнойПродукции;
	НоваяЗапись.Статус                    = Статус;   
	НоваяЗапись.ДлинаАннулировано         = ДлинаАннулировано;
	
КонецПроцедуры
